tutorial.org
#+TITLE: Orient Tutorial
#+OPTIONS: author:nil creator:nil timestamp:nil
#+SETUPFILE: theme-readtheorg.setup
For a (possibly) better reading experience, try the [[https://filecoin-project.github.io/orient/tutorial.html][HTML site]].

[[https://github.com/filecoin-project/orient][Orient]] is implemented in [[http://www.lispworks.com/documentation/HyperSpec/Front/][Common Lisp]]. This tutorial won't teach you that, but if you follow the examples you should be
able to pick up the basics pretty quickly.

* Relational Data
First, load Orient:
#+BEGIN_SRC lisp
(asdf:load-system :orient)
#+END_SRC

#+RESULTS:
: T

#+BEGIN_SRC lisp :package orient :exports results :results raw :var timestamp=(format-time-string "[%F %r]: ")
  (format t "~A Using commit ~A" timestamp (project-commit-link :org))
#+END_SRC

#+RESULTS:
[2019-08-15 06:25:17 PM]:  Using commit [[https://github.com/filecoin-project/orient/commit/78089b6d3bf72429a18a56ab23f03ab88893f256
][78089b6d3bf72429a18a56ab23f03ab88893f256
]]


For this tutorial, we will work in the =SCRATCH= package.
#+BEGIN_SRC lisp :exports both
(in-package scratch)
#+END_SRC

Orient works on relational data, so we need to create and manipulate it. We can construct a tuple like this:
#+BEGIN_SRC lisp :package scratch :exports both
(tuple (a 1) (b 2))
#+END_SRC

#+RESULTS:
: #{| (A 1) (B 2) |}

In this tutorial, we will use =ISETQ= (interactive =SETQ=) for convenience to define top-level variables.
#+BEGIN_SRC lisp :package scratch :exports both
(isetq t1 (tuple (a 1) (b 2)))
#+END_SRC

#+RESULTS:
: #{| (A 1) (B 2) |}

Extract values from tuples with =TREF=.

#+BEGIN_SRC lisp :package scratch :exports both
(tref 'b t1)
#+END_SRC

#+RESULTS:
: 2

=TREF= also defines a place we can =SETF=.

#+BEGIN_SRC lisp :package scratch :exports both
(setf (tref 'a t1) 9)

t1
#+END_SRC

#+RESULTS:
: #{| (A 9) (B 2) |}

For convenience, you can also use the =WITH-ATTRIBUTES= macro.

#+BEGIN_SRC lisp :package scratch :exports both
  (with-attributes (a b) t1
     (+ b a))
#+END_SRC

#+RESULTS:
: 11

And this also allows you to set (=SETQ= or =SETF= both work).
#+BEGIN_SRC lisp :package scratch :exports both
  (with-attributes (a b) t1
    (setq b 3))

  t1
#+END_SRC

#+RESULTS:
: #{| (A 9) (B 3) |}

A relation is a /set/ of tuples. (There is not yet any concept of 'key', so all attributes together constitute the key.) There is
a convenient syntax for creating relations.

#+BEGIN_SRC lisp :package orient.scratch :exports both
  (isetq r1 (relation (a b c)
                      (1 2 3)
                      (4 5 6)
                      (7 8 9)))
#+END_SRC

#+RESULTS:
: #<RELATION #[ A B C ] #{
:                         #{| (A 1) (B 2) (C 3) |}
:                         #{| (A 4) (B 5) (C 6) |}
:                         #{| (A 7) (B 8) (C 9) |} }>

We can also create a relation from constituent tuples. Note that one tuple (=T1=) is deduplicated.

#+BEGIN_SRC lisp :package scratch :exports both
(isetq r2 (make-relation (list t1 (tuple (a 3) (b 8)) (tuple (a 7) (b 8)) t1)))
#+END_SRC

#+RESULTS:
: #<RELATION #[ A B ] #{
:                       #{| (A 3) (B 8) |}
:                       #{| (A 7) (B 8) |}
:                       #{| (A 9) (B 3) |} }>


We can get a relation's cardinality.
#+BEGIN_SRC lisp :package scratch :exports both
(cardinality r1)
#+END_SRC

#+RESULTS:
: 3

And its attributes.
#+BEGIN_SRC lisp :package scratch :exports both
(attributes r1)
#+END_SRC

#+RESULTS:
: #{ A B C }

Tuples have attributes too.
#+BEGIN_SRC lisp :package scratch :exports both
(attributes t1)
#+END_SRC

#+RESULTS:
: #{ A B }

You can join tuples and relations with =JOIN= (which implements a 'natural join'). This concatenates tuples with
matching attributes from either of its arguments.
#+BEGIN_SRC lisp :package scratch :exports both
(join r1 r2)
#+END_SRC

#+RESULTS:
: #<RELATION #[ A B C ] #{ #{| (A 7) (B 8) (C 9) |} }>

Joining a tuple with a relation lets you select a subset of its tuples.
#+BEGIN_SRC lisp :package scratch :exports both
(join (tuple (b 8)) r2)
#+END_SRC

#+RESULTS:
: #<RELATION #[ A B ] #{ #{| (A 3) (B 8) |} #{| (A 7) (B 8) |} }>

No shared attributes:
#+BEGIN_SRC lisp :package scratch :exports both
(join (tuple (a 1)) (tuple (b 2)))
#+END_SRC

#+RESULTS:
: #{| (A 1) (B 2) |}

No match:
#+BEGIN_SRC lisp :package scratch :exports both
(join (tuple (a 1)) (tuple (a 2)))
#+END_SRC

#+RESULTS:
: NIL

Cartesian product:
#+BEGIN_SRC lisp :package scratch :exports both
  (join (relation (a) (1) (2) (3)) (relation (b) (1) (2) (3)))
#+END_SRC

#+RESULTS:
#+begin_example
#<RELATION #[ A B ] #{
                      #{| (A 1) (B 1) |}
                      #{| (A 1) (B 2) |}
                      #{| (A 1) (B 3) |}
                      #{| (A 2) (B 1) |}
                      #{| (A 2) (B 2) |}
                      #{| (A 2) (B 3) |}
                      #{| (A 3) (B 1) |}
                      #{| (A 3) (B 2) |}
                      #{| (A 3) (B 3) |} }>
#+end_example

** What about the rest of relational algebra?

More is available, but not all or most yet. See [[https://github.com/filecoin-project/orient/blob/master/base/relation.lisp][source]] for details.

For now, only what has been needed for Orient is implemented. The rest will be naturally built out over time.

Now move on to the [[Orient][Orient]] section of this tutorial.

