tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Orient Tutorial</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Orient Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Relational Data</a>
<ul>
<li><a href="#sec-1-1">1.1. What about the rest of relational algebra?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Orient Basics</a></li>
</ul>
</div>
</div>
<p>
For a (possibly) better reading experience, try the <a href="https://filecoin-project.github.io/orient/">HTML site</a>.
</p>

<p>
<a href="https://github.com/filecoin-project/orient">Orient</a> is implemented in <a href="http://www.lispworks.com/documentation/HyperSpec/Front/">Common Lisp</a>. This tutorial won't teach you that, but if you follow the examples you should be
able to pick up the basics pretty quickly.
</p>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Relational Data</h2>
<div class="outline-text-2" id="text-1">
<p>
First, load Orient:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(asdf:load-system :orient)
</pre>
</div>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2019-08-15 05:46:48 PM]</span></span>:  Using commit <a href="https://github.com/filecoin-project/orient/commit/36978087f57f8f5d39a163a86a8ab96a1225472e">36978087f57f8f5d39a163a86a8ab96a1225472e
</a>
For this tutorial, we will work in the <code>SCRATCH</code> package.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(in-package scratch)
</pre>
</div>

<p>
Orient works on relational data, so we need to create and manipulate it. We can construct a tuple like this:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(tuple (a 1) (b 2))
</pre>
</div>

<pre class="example">
#{| (A 1) (B 2) |}
</pre>

<p>
In this tutorial, we will use <code>ISETQ</code> (interactive <code>SETQ</code>) for convenience to define top-level variables.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(isetq t1 (tuple (a 1) (b 2)))
</pre>
</div>

<pre class="example">
#{| (A 1) (B 2) |}
</pre>

<p>
Extract values from tuples with <code>TREF</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(tref 'b t1)
</pre>
</div>

<pre class="example">
2
</pre>

<p>
<code>TREF</code> also defines a place we can <code>SETF</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(setf (tref 'a t1) 9)

t1
</pre>
</div>

<pre class="example">
#{| (A 9) (B 2) |}
</pre>

<p>
For convenience, you can also use the <code>WITH-ATTRIBUTES</code> macro.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(with-attributes (a b) t1
   (+ b a))
</pre>
</div>

<pre class="example">
11
</pre>

<p>
And this also allows you to set (<code>SETQ</code> or <code>SETF</code> both work).
</p>
<div class="org-src-container">

<pre class="src src-lisp">(with-attributes (a b) t1
  (setq b 3))

t1
</pre>
</div>

<pre class="example">
#{| (A 9) (B 3) |}
</pre>

<p>
A relation is a <i>set</i> of tuples. (There is not yet any concept of 'key', so all attributes together constitute the key.) There is
a convenient syntax for creating relations.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(isetq r1 (relation (a b c)
                    (1 2 3)
                    (4 5 6)
                    (7 8 9)))
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ A B C ] #{
                        #{| (A 1) (B 2) (C 3) |}
                        #{| (A 4) (B 5) (C 6) |}
                        #{| (A 7) (B 8) (C 9) |} }&gt;
</pre>

<p>
We can also create a relation from constituent tuples. Note that one tuple (<code>T1</code>) is deduplicated.
</p>

<div class="org-src-container">

<pre class="src src-lisp">(isetq r2 (make-relation (list t1 (tuple (a 3) (b 8)) (tuple (a 7) (b 8)) t1)))
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ A B ] #{
                      #{| (A 3) (B 8) |}
                      #{| (A 7) (B 8) |}
                      #{| (A 9) (B 3) |} }&gt;
</pre>


<p>
We can get a relation's cardinality.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(cardinality r1)
</pre>
</div>

<pre class="example">
3
</pre>

<p>
And its attributes.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(attributes r1)
</pre>
</div>

<pre class="example">
#{ A B C }
</pre>

<p>
Tuples have attributes too.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(attributes t1)
</pre>
</div>

<pre class="example">
#{ A B }
</pre>

<p>
You can join tuples and relations with <code>JOIN</code> (which implements a 'natural join'). This concatenates tuples with
matching attributes from either of its arguments.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(join r1 r2)
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ A B C ] #{ #{| (A 7) (B 8) (C 9) |} }&gt;
</pre>

<p>
Joining a tuple with a relation lets you select a subset of its tuples.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(join (tuple (b 8)) r2)
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ A B ] #{ #{| (A 3) (B 8) |} #{| (A 7) (B 8) |} }&gt;
</pre>

<p>
No shared attributes.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(join (tuple (a 1)) (tuple (b 2)))
</pre>
</div>

<pre class="example">
#{| (A 1) (B 2) |}
</pre>

<p>
No match.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(join (tuple (a 1)) (tuple (a 2)))
</pre>
</div>

<pre class="example">
NIL
</pre>

<p>
Cartesian product.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(join (relation (a) (1) (2) (3)) (relation (b) (1) (2) (3)))
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ A B ] #{
                      #{| (A 1) (B 1) |}
                      #{| (A 1) (B 2) |}
                      #{| (A 1) (B 3) |}
                      #{| (A 2) (B 1) |}
                      #{| (A 2) (B 2) |}
                      #{| (A 2) (B 3) |}
                      #{| (A 3) (B 1) |}
                      #{| (A 3) (B 2) |}
                      #{| (A 3) (B 3) |} }&gt;
</pre>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What about the rest of relational algebra?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
More is available, but not all or most yet. See <a href="https://github.com/filecoin-project/orient/blob/master/base/relation.lisp">source</a> for details.
</p>

<p>
For now, only what has been needed for Orient is implemented. The rest will be naturally built out over time.
</p>

<p>
Now move on to the <i>Orient</i> section of this tutorial.
</p>
</div>
</div>
</div>
