tutorial.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Orient Basics</h2>
<div class="outline-text-2" id="text-2">
<p>
This section of the tutorial will show you Orient basics. If you haven't looked at the <a href="#sec-1">Relational Data</a> section yet, some
things might be hard to follow, so if you get lost consider backtracking.
</p>

<p>
Orient uses schemas to define parameters. For now, these only associate descriptions, but types and units will be supported in the future.
</p>
<div class="org-src-container">

<pre class="src src-lisp">  (defschema woozleton "Where the Woozles live."
    (population "How many (Woozle) people live here?")
    (men "How many men in town?")
    (women "How many women in town?")
    (adults "How many adults in town?")
    (children "How many children in town?")
    (pets "How many pets are there?")
    (pets-per-child "How many pets does each child have?"))
)
</pre>
</div>

<pre class="example">
#&lt;SCHEMA {1006C75D53}&gt;
</pre>

<p>
Before we perform any calculation, we need to define the relationship between variables. In this case, we will define
<code>adults</code> as the sum of <code>men</code> and <code>women</code>; and <code>population</code> as the sum of <code>adults</code> and <code>children</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(defconstraint-system woozle-population
    ((adults (+ men women))
     (population (+ adults children))
     (pets (* children pets-per-child))))
</pre>
</div>

<pre class="example">
#&lt;SYSTEM (:COMPONENTS
          ((COMPONENT ((TRANSFORMATION (SIG #{
                                              MEN
                                              WOMEN } -&gt; #{
                                                           ADULTS }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              MEN
                                              ADULTS } -&gt; #{
                                                            WOMEN }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              WOMEN
                                              ADULTS } -&gt; #{
                                                            MEN }) === "FN()")))
           (COMPONENT ((TRANSFORMATION (SIG #{
                                              ADULTS
                                              CHILDREN } -&gt; #{
                                                              POPULATION }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              ADULTS
                                              POPULATION } -&gt; #{
                                                                CHILDREN }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              CHILDREN
                                              POPULATION } -&gt; #{
                                                                ADULTS }) === "FN()")))
           (COMPONENT ((TRANSFORMATION (SIG #{
                                              CHILDREN
                                              PETS-PER-CHILD } -&gt; #{
                                                                    PETS }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              PETS
                                              CHILDREN } -&gt; #{
                                                              PETS-PER-CHILD }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              PETS
                                              PETS-PER-CHILD } -&gt; #{
                                                                    CHILDREN }) === "FN()"))))
          :SUBSYSTEMS NIL :SCHEMA NIL :DATA NIL)&gt;
</pre>

<p>
The resulting system contains transformations for deriving parameters from each other, when possible.
</p>
<pre class="example">
#&lt;SYSTEM (:COMPONENTS
          ((COMPONENT ((TRANSFORMATION (SIG #{
                                              MEN
                                              WOMEN } -&gt; #{
                                                           ADULTS }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              MEN
                                              ADULTS } -&gt; #{
                                                            WOMEN }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              WOMEN
                                              ADULTS } -&gt; #{
                                                            MEN }) === "FN()")))
           (COMPONENT ((TRANSFORMATION (SIG #{
                                              ADULTS
                                              CHILDREN } -&gt; #{
                                                              POPULATION }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              ADULTS
                                              POPULATION } -&gt; #{
                                                                CHILDREN }) === "FN()")
                       (TRANSFORMATION (SIG #{
                                              CHILDREN
                                              POPULATION } -&gt; #{
                                                                ADULTS }) === "FN()"))))
          :SUBSYSTEMS NIL :SCHEMA NIL :DATA NIL)&gt;
</pre>

<p>
Now that we have defined the relationship between parameters, we can use the convenience function, <code>ask</code> to ask
questions. <code>ask</code> takes a system, a list of target attributes, and input data. If Orient can find a solution it will be
returned.
</p>

<p>
Let's calculate <code>population</code> and <code>adults</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(population adults)
     (tuple (men 10) (women 11) (children 5)))
</pre>
</div>

<pre class="example">
#{| (ADULTS 21) (POPULATION 26) |}
</pre>


<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(children)
     (tuple (men 10) (women 11) (population 100)))
</pre>
</div>

<pre class="example">
#{| (CHILDREN 79) |}
</pre>

<p>
What if we know the population and number of adults but not how many men and children there are?
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(men children)
     (tuple (women 11) (adults 25) (population 100)))
</pre>
</div>

<pre class="example">
#{| (MEN 14) (CHILDREN 75) |}
</pre>

<p>
And remember, Orient is relational, so our input can be a relation and so can the output. Here we join a relation
containing a number of different populations with a tuple containing the (constant) numbers of women and adults. And in
order to make our results more legible, we ask for the population too.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(population children)
     (join (relation (population)
                     (30)
                     (50)
                     (100)
                     (200))
           (tuple (women 11) (adults 25))))
</pre>
</div>

<pre class="example">
#&lt;RELATION #[ CHILDREN POPULATION ] #{
                                      #{| (CHILDREN 5) (POPULATION 30) |}
                                      #{| (CHILDREN 25) (POPULATION 50) |}
                                      #{| (CHILDREN 75) (POPULATION 100) |}
                                      #{| (CHILDREN 175) (POPULATION 200) |} }&gt;
</pre>

<p>
If we want more information about the solution, we can use <code>solve-for</code>. <code>solve-for</code> returns the whole solution and
doesn't project just the requested attributes like <code>ask</code> does.
</p>

<p>
It also returns some other values: the <code>plan</code>, an optional <code>report</code> (which we didn't request here), and the
<code>initial-data</code> (which might have been assembled in a more complex way than in this example).
</p>
<div class="org-src-container">

<pre class="src src-lisp">(solve-for (find-system 'woozle-population) '(population children) (join (tuple (population 50)) (tuple (women 11) (adults 25))))
</pre>
</div>

<pre class="example">
#{| (MEN 14) (WOMEN 11) (ADULTS 25) (CHILDREN 25) (POPULATION 50) |}
((TRANSFORMATION (SIG #{ WOMEN ADULTS } -&gt; #{ MEN }) === "FN()")
 (TRANSFORMATION (SIG #{ ADULTS POPULATION } -&gt; #{ CHILDREN }) === "FN()"))
""
#{| (WOMEN 11) (ADULTS 25) (POPULATION 50) |}
</pre>

<p>
Notice that we see the solved values for all attributes.
</p>

<p>
The list of transformations below is the plan. In this example, see that Orient first calculates <code>MEN</code> from <code>WOMEN</code> and
<code>ADULTS</code>, then calculate <code>CHILDREN</code> from <code>ADULTS</code> and <code>POPULATION</code>.
</p>

<p>
Finally, we see the input tuple itself.
</p>

<pre class="example">
#{| (MEN 14) (WOMEN 11) (ADULTS 25) (CHILDREN 25) (POPULATION 50) |}
((TRANSFORMATION (SIG #{ WOMEN ADULTS } -&gt; #{ MEN }) === "FN()")
 (TRANSFORMATION (SIG #{ ADULTS POPULATION } -&gt; #{ CHILDREN }) === "FN()"))
""
#{| (WOMEN 11) (ADULTS 25) (POPULATION 50) |}
</pre>


<p>
The output is a bit hard to read, since multiple values are jammed up together, so let's look at another example which
binds each value to a variable and stores the results. We will also use the most general function, <code>solve</code> instead of
the often-more-conveneitn <code>solve-for</code>.
</p>

<p>
This introduces the new concept of a <i>signature</i>, created below with <code>sig</code>. We solve <i>problems</i> over <i>systems</i>. (<i>Problems</i>
have the same shape as simple <i>signatures</i>, so we use <i>signatures</i> here for now. This will change in the future, since the
overloading of <i>signature</i> can be confusing. We mention it here to hopefully reduce that confusion but realize the
opposite effect may have been accomplished.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(multiple-value-bind (result plan report initial-values)
    (solve (find-system 'woozle-population) 
           (sig (men women children) -&gt; (adults))
           (tuple (men 10) (women 11) (children 5)))

  (isetq res1 result)
  (isetq plan1 plan)
  (isetq report1 report)
  res1)
</pre>
</div>

<pre class="example">
#{| (MEN 10) (WOMEN 11) (ADULTS 21) (CHILDREN 5) (POPULATION 26) |}
</pre>

<p>
The results:
</p>
<pre class="example">
#{| (MEN 10) (WOMEN 11) (ADULTS 21) (CHILDREN 5) (POPULATION 26) |}
</pre>

<p>
The plan:
</p>
<div class="org-src-container">

<pre class="src src-lisp">plan1
</pre>
</div>

<pre class="example">
((TRANSFORMATION (SIG #{ MEN WOMEN } -&gt; #{ ADULTS }) === "FN()")
 (TRANSFORMATION (SIG #{ ADULTS CHILDREN } -&gt; #{ POPULATION }) === "FN()"))
</pre>


<p>
And here is another way to create a signature, without the convenience macro, <code>sig</code>. We compare the two results using
<code>same</code> which is generally aware of Orient's domain object equality and is useful when writing tests.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(same (make-signature '(men women children) '(adults))
      (sig (men women children) -&gt; (adults)))
</pre>
</div>

<pre class="example">
T
</pre>

<p>
And, just to show a slightly more complex example, let's not forget the pets!
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
 '(men children pets) (tuple (women 11) (adults 25) (population 100) (pets-per-child 3)))
</pre>
</div>

<pre class="example">
#{| (MEN 14) (PETS 225) (CHILDREN 75) |}
</pre>

<p>
We can still calculate in different directions.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(children pets-per-child)
     (tuple (women 11) (men 17) (population 100) (pets 200.0)))
</pre>
</div>

<pre class="example">
#{| (CHILDREN 72) (PETS-PER-CHILD 2.7777777) |}
</pre>

<p>
But if we ask a question that can't be solved, we're out of luck.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(ask (find-system 'woozle-population)
     '(men children)
     (tuple (women 11) (adults 25) (population 100) (pets-per-child 3) (pets 200)))
</pre>
</div>

<pre class="example">
NIL
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
